CSI API ETABS v1
cDetailing.GetDetailedBeamLines_1 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedBeamLines_1(
	ref int NumberItems,
	ref string[] TowerNames,
	ref string[] StoryNames,
	ref string[] BeamLineIDs
)
Function GetDetailedBeamLines_1 (
	ByRef NumberItems As Integer,
	ByRef TowerNames As String(),
	ByRef StoryNames As String(),
	ByRef BeamLineIDs As String()
) As Integer
Dim instance As cDetailing
Dim NumberItems As Integer
Dim TowerNames As String()
Dim StoryNames As String()
Dim BeamLineIDs As String()
Dim returnValue As Integer
returnValue = instance.GetDetailedBeamLines_1(NumberItems,
	TowerNames, StoryNames, BeamLineIDs)
int GetDetailedBeamLines_1(
	int% NumberItems,
	array<String^>^% TowerNames,
	array<String^>^% StoryNames,
	array<String^>^% BeamLineIDs
)
abstract GetDetailedBeamLines_1 :
        NumberItems : int byref *
        TowerNames : string[] byref *
        StoryNames : string[] byref *
        BeamLineIDs : string[] byref -> int
Parameters
NumberItems
Type: System.Int32
TowerNames
Type: System.String[]
StoryNames
Type: System.String[]
BeamLineIDs
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace